{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.9", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_10", "layers": [{"name": "input_21", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 76], "dtype": "float32", "sparse": false, "name": "input_21"}, "inbound_nodes": []}, {"name": "dense_20", "class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_21", 0, 0, {}]]]}, {"name": "appPackage", "class_name": "Dense", "config": {"name": "appPackage", "trainable": true, "dtype": "float32", "units": 11, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_20", 0, 0, {}]]]}, {"name": "category", "class_name": "Dense", "config": {"name": "category", "trainable": true, "dtype": "float32", "units": 6, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_20", 0, 0, {}]]]}, {"name": "ledARGB", "class_name": "Dense", "config": {"name": "ledARGB", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_20", 0, 0, {}]]]}, {"name": "priority", "class_name": "Dense", "config": {"name": "priority", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_20", 0, 0, {}]]]}, {"name": "vibrate", "class_name": "Dense", "config": {"name": "vibrate", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_20", 0, 0, {}]]]}, {"name": "visibility", "class_name": "Dense", "config": {"name": "visibility", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_20", 0, 0, {}]]]}, {"name": "subject", "class_name": "Dense", "config": {"name": "subject", "trainable": true, "dtype": "float32", "units": 37, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_20", 0, 0, {}]]]}, {"name": "concatenate_10", "class_name": "Concatenate", "config": {"name": "concatenate_10", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["appPackage", 0, 0, {}], ["category", 0, 0, {}], ["ledARGB", 0, 0, {}], ["priority", 0, 0, {}], ["vibrate", 0, 0, {}], ["visibility", 0, 0, {}], ["subject", 0, 0, {}]]]}], "input_layers": [["input_21", 0, 0]], "output_layers": [["concatenate_10", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "appPackage_10/kernel", "shape": [16, 11], "dtype": "float32"}, {"name": "appPackage_10/bias", "shape": [11], "dtype": "float32"}, {"name": "category_10/kernel", "shape": [16, 6], "dtype": "float32"}, {"name": "category_10/bias", "shape": [6], "dtype": "float32"}, {"name": "dense_20/kernel", "shape": [76, 16], "dtype": "float32"}, {"name": "dense_20/bias", "shape": [16], "dtype": "float32"}, {"name": "ledARGB_10/kernel", "shape": [16, 5], "dtype": "float32"}, {"name": "ledARGB_10/bias", "shape": [5], "dtype": "float32"}, {"name": "priority_10/kernel", "shape": [16, 3], "dtype": "float32"}, {"name": "priority_10/bias", "shape": [3], "dtype": "float32"}, {"name": "subject_10/kernel", "shape": [16, 37], "dtype": "float32"}, {"name": "subject_10/bias", "shape": [37], "dtype": "float32"}, {"name": "vibrate_10/kernel", "shape": [16, 4], "dtype": "float32"}, {"name": "vibrate_10/bias", "shape": [4], "dtype": "float32"}, {"name": "visibility_10/kernel", "shape": [16, 2], "dtype": "float32"}, {"name": "visibility_10/bias", "shape": [2], "dtype": "float32"}]}]}